Tekla Open API Reference for Tekla Structures 2025
AnalysisPartAreaAttributes Class
 The AnalysisPartAreaAttributes class contains information related to analysis part area attributes.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisPartAreaAttributes
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisPartAreaAttributes
Public NotInheritable Class AnalysisPartAreaAttributes
The AnalysisPartAreaAttributes type exposes the following members.
Constructors
Name | Description
AnalysisPartAreaAttributes
Initializes a new instance of the AnalysisPartAreaAttributes class
Top
Properties
Name | Description
AreaElementSizeHoles
 Gets or sets the area element size holes.
AreaElementSizeX
 Gets or sets the area element size X.
AreaElementSizeY
 Gets or sets the area element size Y.
AreaElementType
 Gets or sets the area element type.
AreaRotationXY
 Gets or sets the area rotation XY.
AreaStartNumber
 Gets or sets the start number of the area.
AreaSupport |  Obsolete.
 Gets or sets the area support.
AreaSupportType
 Gets or sets the area support type.
MinimumAreaHoleSize
 Gets or sets the minimum area hole size.
RigidDiaphragmFilterName
 Gets or sets the filter name of the rigid diaphragm.
UseSimpleArea
 Gets or sets a value indicating whether simple areas are used.
Top
See Also
Reference
Tekla.Structures.Analysis Namespace